{"_filedata":{"slug":"introducing-the-messages-api-sandbox"},"title":"Introducing the Messages API Sandbox","description":"","thumbnail":"https://www.nexmo.com/wp-content/uploads/2020/04/E_Messaging-API-Sandbox_1200x600.png","author":244,"published":true,"published_at":"2020-04-08T15:50:34","tags":[1744,1306,1743,1255,754],"body":"<p>The Messages API Sandbox is a new way of developing and testing any application you want to build using <a href=\"https://www.whatsapp.com/\">WhatsApp</a>, <a href=\"https://www.viber.com/\">Viber</a>, or <a href=\"https://www.messenger.com/\">Facebook Messenger</a> via our <a href=\"https://developer.nexmo.com/messages/overview\">Messages API</a>.</p>\n<p>The <a href=\"https://dashboard.nexmo.com/messages/sandbox\">Sandbox</a> allows you to link your own WhatsApp, Viber, or Facebook Messenger accounts so you can start sending and receiving test messages on your own devices as you build.</p>\n<p>In this tutorial, we&#8217;re going to run through how you get everything set up.</p>\n<h2>Prerequisites</h2>\n<p>To use the Messages API, you will need a <a href=\"https://dashboard.nexmo.com/sign-up?utm_source=messages-sandbox-intro&amp;utm_medium=web\">Vonage Communications API account</a>. If you don&#8217;t already have one, <a href=\"https://dashboard.nexmo.com/sign-up?utm_source=messages-sandbox-intro&amp;utm_medium=web\">you can sign up for free</a> and get an initial €2 credit.</p>\n<p>Once you have your account, you&#8217;ll also need:</p>\n<ul>\n<li>A smartphone with WhatsApp, Viber, or Facebook Messenger installed.</li>\n<li>A command line or terminal application.</li>\n</ul>\n<h2>Whitelist Yourself</h2>\n<p>Head to the <a href=\"https://dashboard.nexmo.com/messages/sandbox\">Messages API Sandbox</a> in your Vonage API dashboard.</p>\n<p>The first step is to whitelist your accounts. As the process is similar for all of the services supported, we&#8217;ll focus on WhatsApp in the External Accounts section.</p>\n<p><img src=\"https://www.nexmo.com/wp-content/uploads/2020/04/external-accounts.png\" alt=\"External Accounts view in the Messages API Sandbox\" width=\"1626\" height=\"576\" class=\"aligncenter size-full wp-image-32024\" /></p>\n<p>Click the &#8216;Add to sandbox&#8217; link to open the list of options. There are three ways to add a new account to the whitelist:</p>\n<ol>\n<li>Scan the QR Code with your camera to open WhatsApp with a pre-defined message.</li>\n<li>Send instructions to yourself, or another team member via email.</li>\n<li>Send a message directly from WhatsApp to the number specified using the unique phrase shown.</li>\n</ol>\n<p><img src=\"https://www.nexmo.com/wp-content/uploads/2020/04/whitelist-options-small.png\" alt=\"Whitelisting options for WhatsApp\" width=\"250\" height=\"587\" class=\"aligncenter size-full wp-image-32032\" /></p>\n<p>Regardless of which method you choose, what you&#8217;re doing is linking the number and account ID you have set on your WhatsApp account to the API Key of your Nexmo account.</p>\n<p>You&#8217;ll know it worked if the bottom of the whitelist section reads <code>You have 1 user(s) whitelisted</code>. If you don&#8217;t see this straight away, click the Refresh link.</p>\n<p>If you would like to link a Viber or Facebook Messenger account, repeat the steps for each service.</p>\n<h2>Send Yourself a Message</h2>\n<p>Once your account is whitelisted, you can test it by sending yourself a message.</p>\n<p>To do this, you can use Terminal on macOS and Linux or Command Line on Windows.</p>\n<p>Copy the code for the service you have chosen from the code block at the bottom of the screen.</p>\n<p><img src=\"https://www.nexmo.com/wp-content/uploads/2020/04/code-block.png\" alt=\"The CURL command required to send a WhatsApp message\" width=\"1624\" height=\"728\" class=\"aligncenter size-full wp-image-32022\" /></p>\n<p>It comes pre-filled with your API credentials, but you need to change the <code>$TO_NUMBER</code> to match the number of the account you previously whitelisted.</p>\n<p>Paste the code into your Terminal application. Hit enter and wait for the response from the server; it should look something like this:</p>\n<p><code>{\"message_uuid\":\"7836a42b-7493-4ece-a7a7-3f59c5058471\"}</code></p>\n<p>Then wait for the message to appear!</p>\n<p><img src=\"https://www.nexmo.com/wp-content/uploads/2020/04/received-message.jpg\" alt=\"What the message looks like when it is received\" width=\"1242\" height=\"225\" class=\"aligncenter size-full wp-image-32025\" /></p>\n<p>Pretty cool, right?</p>\n<h2>Connect to Your Application via Webhooks</h2>\n<p>CURL is excellent and all, but we know you&#8217;re not here to send messages to yourself from the command line.</p>\n<p>To give your application the ability to receive inbound messages from any of the supported services, you can set up an <code>Inbound</code> webhook.</p>\n<p><img src=\"https://www.nexmo.com/wp-content/uploads/2020/04/webhooks.png\" alt=\"The Webhooks Settings\" width=\"1340\" height=\"552\" class=\"aligncenter size-full wp-image-32026\" /></p>\n<p>To receive inbound messages, first ensure that your application has an endpoint to listen for messages on and that it can receive <code>POST</code> requests. You can call it whatever you like; we hear that <code>/inbound</code> is a popular choice.</p>\n<p>Before you deploy your application to a server, you can use an app like <a href=\"https://ngrok.com\">Ngrok</a> to make it accessible to the outside world. There are more details on how to set this up in our <a href=\"https://developer.nexmo.com/tools/ngrok\">documentation</a>.</p>\n<p>It&#8217;s good to know what is happening to the messages your application sends. To help with this, we provide a <code>Status</code> webhook that reports any changes the occur along the delivery path.</p>\n<p>For example, if you want to know if messages sent by your application are arriving, it would be reported via the status webhook using a <code>delivered</code> status. Although using this webhook is optional, it is an excellent choice to monitor it actively and record the data it sends you.</p>\n<h2>You Can Take It From Here</h2>\n<p>The Messages API Sandbox allows you to start working with WhatsApp, Viber, and Facebook Messenger quickly and easily. You can now connect any of these services to your new or existing applications, so what will you build with them?</p>\n<p>Start by digging into the <a href=\"https://developer.nexmo.com/messages/overview\">documentation for the Messages API</a>.</p>\n<p>If you&#8217;re looking for some inspiration, here are five other tutorials that we&#8217;ve created that might spark some ideas:</p>\n<ul>\n<li><a href=\"https://www.nexmo.com/blog/2020/03/05/save-received-sms-messages-with-airtable-and-node-js-dr\">Save Received SMS Messages with Airtable and Node.js</a>—You could change this to store received WhatsApp, Viber or Facebook Messenger Messages.</li>\n<li><a href=\"https://www.nexmo.com/blog/2019/07/01/discover-your-twitters-positivity-score-with-react-dr\">Discover your Twitter Positivity Score</a>—You could build on this React example and have it send the score via Viber or WhatsApp instead.</li>\n<li><a href=\"https://www.nexmo.com/blog/2020/03/27/is-it-the-weekend-yet-build-a-web-scraping-app-with-sms-to-find-out-dr\">Scrape the Web and Send SMS Updates</a>—You could take this example app and have it send the results via WhatsApp.</li>\n<li><a href=\"https://www.nexmo.com/blog/2020/03/11/real-time-sms-demo-with-react-node-and-google-translate-dr\">Real Time SMS Translations with Node, React, and Google</a>—Why not add to this application and get it to translate SMS, WhatsApp or Facebook Messenger messages?</li>\n<li><a href=\"https://www.nexmo.com/blog/2020/01/29/how-send-receive-sms-messages-with-node-js-azure-functions-dr\">Send and Receive SMS Messages with Node.js and Azure Functions</a>—Try amending this Azure Function so it sends Viber messages instead of SMS.</li>\n</ul>\n<p>Whatever you&#8217;re building, we&#8217;re here for you if you need us. Head on over to the <a href=\"https://developer.nexmo.com/community/slack\">Vonage Developer Community Slack</a> to pick up the conversation, share tips, and learn from others.</p>\n"}