{"_filedata":{"slug":"running-off-sites-remote-teams-dr"},"title":"Running an Off-Site for Remote Teams","description":"","thumbnail":"https://www.nexmo.com/wp-content/uploads/2020/02/E_Off-Site_Team_1200x600.png","author":259,"published":true,"published_at":"2020-03-03T12:51:07","tags":[360,1696,1697],"body":"<p>If you work in developer relations, chances are your team is distributed across the globe. Our group at Vonage is currently spread over three continents and counting 38 members. Coming together to celebrate who we are, focus on our work and simply spend time together is an indispensable part of our team’s culture. For this reason, we all gather at the same place, once or twice a year for our off-site.</p>\n<p>In our careers, we’ve collectively attended and planned over 130 team off-sites and continuously leverage this experience for iteration and improvement. We work hard to make them worthwhile to travel to, and always try to set the right goals, keep inclusivity in mind and empower our team to actively participate during all planning stages.</p>\n<p>Whether your remote team is made up of three, ten or 50 people, there are common things you can consider to get the most out of your time together. Full disclaimer, some of these apply to any type off-site. So, to make your next team get-together a success, here are some tips to help you best prepare before, during and after the main event.</p>\n<h2>Before the Off-Site</h2>\n<h3>Look Back, Ask Questions and Iterate</h3>\n<p>Start from the past. Has your team already been to an off-site? You should look at any feedback and try to address issues raised regarding any and all aspects of the experience. You can also send out a survey and see what type of activities and sessions people are interested in. You might not be able to grant everyone’s wishes but it’s a good start.</p>\n<p>Our team had recently grown before our 2019 global off-site in Athens, Greece. To make sure we were all on the same page and to understand what folks wanted to do during and get out of the week we sent out a survey. Here are some examples of questions and responses:</p>\n<p>What do you want to be more knowledgeable about at the end of the week?</p>\n<blockquote><p>\n  My fellow team members. Just spending time with them in person will be the biggest takeaway for me.</p>\n<p>  Public Speaking &#8211; I feel I can always improve there.\n</p></blockquote>\n<p>What type of sessions should we be doing?</p>\n<blockquote><p>\n  Time to break out in smaller, specialist groups, perhaps by initiative, by product, by tech stack. Lots of collaboration and workshops for us to train one another. Stuff that’s more than one person talking and everyone listening &#8211; we can do that remotely! Facilitated discussions would be amazing and if the sessions are not intended to include everyone, I’m sure some great content will break out in the hallway track too&#8230;</p>\n<p>  Time to just write code together.\n</p></blockquote>\n<h3>Choosing the Location</h3>\n<p>Location, location, location. This is the item on our planning checklist that takes the longest to agree on. Here are some questions you can ask yourself to help decide on this:</p>\n<ul>\n<li>What’s your budget?</li>\n<li>What requirements do you have for the meeting space and hotel?</li>\n<li>Where are most of your team based?</li>\n<li>Can everyone travel to your proposed destination?</li>\n<li>How long will it take them to get there?</li>\n<li>What’s the local weather like that time of year?</li>\n<li>Is there an airport with international connections?</li>\n<li>Does the location have good public transport?</li>\n</ul>\n<p>For our most recent off-site in January 2020, we chose to go to Miami, Florida. Here’s why:</p>\n<ul>\n<li>The city met our needs in terms of accommodation, meeting spaces available and opportunities for team-building and social activities</li>\n<li>The weather forecast for January seemed pleasant</li>\n<li>It took everyone under 20 hours to travel there</li>\n<li>We held our previous global off-site in Europe so we aimed for less travel time for US folks who made up 40% of attendees. Four people who usually work from home were close enough to drive to the location.</li>\n</ul>\n<p><a href=\"https://www.nexmo.com/wp-content/uploads/2020/02/blog-3.png\"><img src=\"https://www.nexmo.com/wp-content/uploads/2020/02/blog-3.png\" alt=\"\" width=\"1172\" height=\"602\" class=\"alignnone size-full wp-image-31426\" /></a></p>\n<h3>Set Clear Goals</h3>\n<p>What does a successful team off-site look like to you and your leadership team? There’s not one right answer but there are questions you can ask yourself to get there. Do you want to work on your roadmap? Figure out what the rest of the year looks like? When setting your goals, make sure they’re attainable and make sense for your team at that specific time. Once you have these in place, repeat them any chance you get, for example, at the top of your itinerary.</p>\n<p>The goals we set for our recent off-site and the reason we chose them were to:</p>\n<ul>\n<li><strong>Build relationships and trust:</strong> a people-first goal meaning that even if we have the brightest and most empathetic individuals in our remote team, it means nothing unless we trust each other and are able to work together</li>\n<li><strong>Align on goals for 2020:</strong> as the off-site took place at the start of the year it was important for us to build team goals that align with our department (Product) and company goals</li>\n<li><strong>Work out how we make the most of our team embedded with Product:</strong> we recently merged the Developer Relations team with Platform Experience to better address the end-to-end developer experience. We wanted our off-site to be a time to hold cross-functional discussions so we augment the effect of this merger.</li>\n</ul>\n<h3>Content That Works for Everyone</h3>\n<p>Send out a draft agenda one to two months in advance to crowdsource content for your working sessions and assign owners against them. The more ownership is spread out, the more invested people will feel and the more diverse your content will be. Designate one or two curators who can ensure sessions align with the off-site goals, help moderators and presenters prepare and consider logistics and room set-up. Another important factor is interactivity. Avoid sessions that are more in the show and tell format and can be delivered via webcast at any point of the year, unless there are important announcements to make. Instead, opt-in for sessions that maximise the value of the in-person experience and make sure to add breaks in-between so people don’t switch off.</p>\n<p>In Miami, apart from the opening session on which you can read more further down, almost every other session included some type of interactivity or active learning. From retrospectives and hacking to public speaking and writing exercises there was a great amount of collaboration stemming from the schedule.</p>\n<p><img src=\"https://www.nexmo.com/wp-content/uploads/2020/02/Screen-Shot-2020-02-27-at-18.12.13.png\" alt=\"\" width=\"746\" height=\"454\" class=\"alignnone size-full wp-image-31431\" /></p>\n<h3>Plan Inclusive Activities</h3>\n<p>When looking into team building and social activities, plan with inclusivity and your team’s wellness in mind. These are easy to overlook if you mostly work remotely and don’t have to consider outdoor accessibility issues. Are there people with mobility issues that won’t be able to join that really amazing hike? Even if you’ve exhausted possibilities for not excluding folks, make sure there’s an alternative they’re happy with.</p>\n<p>We had two attendees with mobility issues at our latest off-site. We reached out directly to talk to them about the possibility of doing a scavenger hunt. We ended up locking the experience to 1.5 hours. One person joined and their team accommodated their pacing, whereas the other opted to rest back at the hotel.</p>\n<p><a href=\"https://www.nexmo.com/wp-content/uploads/2020/02/blog-4.png\"><img src=\"https://www.nexmo.com/wp-content/uploads/2020/02/blog-4.png\" alt=\"\" width=\"788\" height=\"496\" class=\"alignnone size-full wp-image-31427\" /></a></p>\n<p>Another important aspect is food and drinks. Consider your team’s dietary requirements when choosing meals and restaurants. There’s nothing worse than being stuck in a meeting room all day with nothing to eat that won’t make you ill. Lastly, try to have options for evening activities that are not centred around food and drinks. We had a semi-impromptu board-game night at last year’s off-site that we need to try and replicate more.</p>\n<h3>Be Aware of Your Environmental Impact</h3>\n<p>Let’s face it, with cross-continental teams most people will have to fly in. Look into your company’s green policy and see if there’s an option to collectively offset your carbon emissions. In addition, keep in mind that some destinations will better cater for alternative means of transport.</p>\n<p>For our off-site in Amsterdam in 2019, about 15% of people got there by train or boat. We also booked a coach for some local transfers and encouraged the team to walk or use public transportation for activities. We’ve also contacted our travel agent in order to get data and understand our team’s carbon footprint more.</p>\n<p>Another approach we take to minimise our ecological footprint has to do with catering. When we order team meals we ask the hotel or meeting space to provide reusable crockery, we order whole fruit instead of fruit salad in plastic cups and have jugs of water instead of bottled. There’s definitely more we and you can be doing but transportation and catering are good places to start from.</p>\n<h2>During the Off-Site</h2>\n<h3>Tackling the All-Important First Session</h3>\n<p>You’ve set your goals and shared with everyone before they arrive. Nevertheless, trying to get everyone on the same level of buy-in can be tricky. There might be people who have their personal goals and try to use the in-person get-together as an opportunity to get stuff they want to be done. To mitigate this, are a few additional things you can do during the first working session that will contribute to the success of your off-site:</p>\n<ul>\n<li>Repeat your goals and what the plan is to achieve them</li>\n<li>Go over the off-site schedule and answer any questions</li>\n<li>Have everyone introduce themselves. There may be people who’ve only met each other virtually.</li>\n<li>Set practical expectations. Should laptops be shut during sessions? Are social activities mandatory?</li>\n<li>Go over highlights and achievements since your last off-site</li>\n<li>Look at company and department goals moving forward</li>\n<li>Share any important organisational information or employee survey results </li>\n</ul>\n<p>In Miami, we incorporated all of the above into a 1.5-hour session that ended up being one of the highest-rated items on our schedule. Out of the total of survey takers following the off-site, 39% rated it as excellent while 46% as very good.</p>\n<h3>Work in Small Groups</h3>\n<p>Getting to know one another and collaborating more closely is arguably achieved more efficiently when you work in smaller groups. At our latest off-site we mixed groups up a few times, taking into account what people’s sub-teams are and where they’re based.</p>\n<p>Here are some small group activities we’ve done in the past:</p>\n<ul>\n<li><strong>Retrospective:</strong> groups of approx. 5 people that discussed things we should start, continue or stop doing</li>\n<li><strong>Hacking:</strong> work on a coding project, new process or anything you can create and share with the team</li>\n<li><strong>Team-building:</strong> choose activities that are ideal for small groups, an element of competition is welcome but should not be the main focus</li>\n</ul>\n<p><img src=\"https://www.nexmo.com/wp-content/uploads/2020/02/Screen-Shot-2020-02-27-at-18.12.31.png\" alt=\"\" width=\"1158\" height=\"708\" class=\"alignnone size-full wp-image-31430\" /></p>\n<h3>Balance Working and Fun Sessions</h3>\n<p>This should undoubtedly be considered when you’re planning your schedule but something whose effect will only be evident during the off-site. If like us one of your goals is for people to spend time together and bond you should aim for a good mix of working sessions, fun activities and also some planned free time for people to form their own groups and experiences. Getting the balance of this right is a challenge.</p>\n<p>From feedback collected after our 2020 off-site, more people classified team building activities as their favourite part of the week rather than working sessions. Here are some things we’ve done in the past if you’re in need of inspiration: sailing trip, cooking classes, interactive museum tours, comic book creation workshop and scavenger hunts.</p>\n<p><a href=\"https://www.nexmo.com/wp-content/uploads/2020/02/blog-5.png\"><img src=\"https://www.nexmo.com/wp-content/uploads/2020/02/blog-5.png\" alt=\"\" width=\"1426\" height=\"1026\" class=\"alignnone size-full wp-image-31429\" /></a></p>\n<h2>After the Off-Site</h2>\n<h3>Conduct a Survey</h3>\n<p>Your off-site is done, everyone’s at home &#8211;  with the necessary minor delays &#8211; and you feel everything’s gone down well. Unless you conduct a survey there’s no way of measuring your actual level of success against your goals.</p>\n<p>We do this anonymously via Google Forms the week after. We collect both quantitative and qualitative data that we then share with the team with comments on how we’ll address issues that arose at the next off-site. An interesting finding from feedback collected for our Miami off-site was that the social aspect of the week seemed to be the main catalyst of success for attendees. In fact, about 40% of people mentioned spending time with colleagues they don’t normally do, was the best thing about the week.</p>\n<h3>Be Accountable</h3>\n<p>Last but not least is accountability. No matter how many discussions you have or feedback you collect, it will all be in vain if you don’t end up with actionable items that have clear owners. It’s even more challenging for a remote team to go away and still keep on the same path.</p>\n<p>To give you an example, as a result of the retrospective session we held at our latest off-site, we decided we wanted to carry these out on a regular basis. As a follow-up action, we have already planned monthly sub-team retrospectives. There’s a dedicated person who will be collecting and tracking all feedback in a spreadsheet as well as our internal Wiki page. We’ll then all get together once per quarter to check against each action item’s progress.</p>\n<h2>What’s in Store for Your Next Off-Site?</h2>\n<p>It’s so important to build relationships that allow folks to carry a feeling of togetherness when they’ve gone back home from an off-site. We hope to have provided you with some food for thought and practical planning tips on what to consider for your remote team’s next off-site. We at least can’t wait to start planning our next one!</p>\n<h2>Further Reading</h2>\n<p>Travel plays a huge part in running an off-site for remote teams. Read more about <a href=\"https://www.nexmo.com/blog/2019/11/27/the-ultimate-devrel-guide-to-travel-dr\">making travel easier for your teams</a>.</p>\n"}