{"_filedata":{"slug":"kevin-joins-the-nexmo-developer-relations-team"},"title":"Kevin Joins the Nexmo Developer Relations Team","description":"","thumbnail":"https://www.nexmo.com/wp-content/uploads/2020/02/observatory.jpg","author":360,"published":true,"published_at":"2020-02-06T16:59:04","tags":[360,1550],"body":"<p>Hey there! My name is Kevin Lewis and I’m super excited to be joining the Developer Relations team at Nexmo.</p>\n<p>I’m a Londoner through and through, growing up near the Wembley Stadium and now living south of the river in beautiful Greenwich with my partner and our lovely little dog <a href=\"https://www.instagram.com/barkyboimoo/\">Moobean</a>. On the way across the river, I took a detour via Birmingham (UK) for 2 years and stint in Reading too.</p>\n<p>My path into tech was quite unconventional &#8211; a friend dragged me along to a hackathon in 2011 which I was completely unequipped for not even being able to write code. The atmosphere and community was incredible and I went away and spent the following months self-teaching web development.</p>\n<p>Getting my start in hackathons informed a lot of what has happened since. I volunteered, sponsored, worked at over 120 events, run a developer events agency, and support community organizers in planning events. I’m currently an organizer of You Got This &#8211; a community conference series on the non-technical &#8216;core&#8217; skills needed for happy, healthy work-lives. My hope is to help others run events that are as impactful to others as that first hackathon was to me.</p>\n<p>Away from work, I am an avid board gamer. From games with a 52-card deck through to bigger and more strategic tabletop games, I love getting around a table with friends (and without screens) to play. As I get to meet folks you’ll likely learn that I always carry <a href=\"https://lws.io/games\">a game or two</a> with me. I also completed a degree in Creative Computing at Goldsmiths University of London and have an interest in creating fun and novel playable experiences with tech.</p>\n<p>In past lives, I have run Developer Relations at Rewired State, helped event organizers through my role at Major League Hacking, supported student community leaders with the GitHub Education team and worked on improving public services as a developer at FutureGov. Through these, I have had the pleasure to meet <a href=\"https://www.nexmo.com/blog/2018/08/27/welcoming-myrsini-to-the-nexmo-developer-relations-team-dr\">Myrsini</a> and <a href=\"https://www.nexmo.com/blog/2019/09/10/bethany-loft-joins-the-nexmo-developer-relations-team-dr\">Beth</a> who I now get to work with at Nexmo.</p>\n<p>And now I’m here—with a super friendly team and ready to support the London tech community in my new role. If you want to connect please feel free to reach out to me on <a href=\"https://twitter.com/_phzn\">Twitter</a> (my DMs are open).</p>\n<p>Peace ✌️</p>\n<p><small><a href=\"https://www.flickr.com/photos/54208548@N00/785771875\">&#8220;The Royal Observatory&#8221;</a> by ferkel is licensed under CC BY-NC-ND 2.0</small></p>\n"}