{"_filedata":{"slug":"how-to-send-sms-reminders-of-google-calendar-events-with-zapier-dr"},"title":"How to Send SMS Reminders of Google Calendar Events with Zapier","description":"","thumbnail":"https://www.nexmo.com/wp-content/uploads/2020/03/E_Google-Calendar-Reminders_1200x600.png","author":358,"published":true,"published_at":"2020-03-04T18:22:53","tags":[360,92,1700],"body":"Are your days packed with meetings and events? Do you find yourself wishing you had an assistant to remind you of what to anticipate next? Fortunately, there is a quick way to make sure you never forget about a meeting and to control how much time you give yourself to prepare for it.\n\nIn this tutorial, we will learn how to send SMS reminders prior to Google Calendar events with [Zapier](https://zapier.com/home), the workflow automation platform. This is a brand new integration (currently in Beta), and we’re excited to bring you use cases that help eliminate unnecessary manual tasks and enable you to focus on what’s most important. Keep reading to find out how you, too, can receive SMS reminders in a matter of minutes—no coding required!\n\n### Prerequisites\n\nTo get started, you will need the following:\n\n1.  A [Nexmo](https://dashboard.nexmo.com/sign-up?utm_source=DEV_REL&utm_medium=github&utm_campaign=https%3A%2F%2Fgithub.com%2Fnexmo-community%2Fsms-event-reminders-with-zapier) account\n2.  A [Zapier](https://zapier.com/home) account\n\nYou’ll receive complimentary credit to purchase SMS enabled numbers when first signing up for your Nexmo account. The free Zapier plan allows for workflows containing two steps, which is all we’ll need for this tutorial.\n\n### Step 1: Create a Zap\n\nLog in to your Zapier account and click the **Make a Zap** button on the sidebar. Zapier workflows are called Zaps, so you’ll see that term used often.\n\nThen, name your Zap by replacing the placeholder text in the header.\n\n### Step 2: Create a Google Calendar Trigger\n\n#### Choose App & Event\n\nUnder **Choose App & Event**, search for and select Google Calendar. Next, open up the list of options under **Choose Trigger Event** and select **Event Start**. This ensures our action (the SMS) will happen prior to the event.\n\n[![Create a Google Cal trigger](https://www.nexmo.com/wp-content/uploads/2020/03/zap1.png)](https://www.nexmo.com/wp-content/uploads/2020/03/zap1.png)\n\n#### Choose Account\n\nNow, select your Google account. If multiple options are presented, make sure that you choose the account containing the calendar you want to use in your Zap.\n\n> Note: The calendar you plan to use must contain events. If it doesn’t, go ahead and schedule an event for today’s date, so we may use it later to test the configuration.\n\n#### Customize Event\n\nYou will then be prompted to choose the calendar, enter how far in advance you’d like to receive SMS reminders, and a search term (optional). If you’re interested in receiving reminders of only certain events, enter a term that may be used to find them. In the example below, SMS reminders will be sent only for the events with “meeting” in them.\n\n[![Customize Zap Event](https://www.nexmo.com/wp-content/uploads/2020/03/zap2.png)](https://www.nexmo.com/wp-content/uploads/2020/03/zap2.png)\n\n> Note: As we are currently using the free plan, **Time Before** must be no less than 16 minutes. Feel free to upgrade your plan for more flexibility.\n\n#### Find Data\n\nNext, Zapier will attempt to find some sample data from Google Calendar to help set up and test the Zap.\n\n[![Find data to test Zap](https://www.nexmo.com/wp-content/uploads/2020/03/zap-data.png)](https://www.nexmo.com/wp-content/uploads/2020/03/zap-data.png)\n\nSelect an event and click **Done Editing** to proceed to the next step. If Zapier has trouble finding data for the trigger, add a new event in Google Calendar and try pulling in more samples.\n\n### Step 3: Configure the Nexmo SMS Action\n\n#### Choose App & Event\n\nWith Google Calendar configured, we’re now ready to add the SMS action to the workflow! To start, search for **Nexmo SMS** in **Choose App & Event**.\n\n[![Configure with SMS](https://www.nexmo.com/wp-content/uploads/2020/03/choose-nexmo.png)](https://www.nexmo.com/wp-content/uploads/2020/03/choose-nexmo.png)\n\nThen, proceed with the default **Send SMS** action event.\n\n#### Choose Account\n\nBefore we can move any further, we need to allow Zapier access to your Nexmo account.\n\n[![Add Nexmo account](https://www.nexmo.com/wp-content/uploads/2020/03/nexmo-account.png)](https://www.nexmo.com/wp-content/uploads/2020/03/nexmo-account.png)\n\nEnter the API key and API secret found at the top of your [Nexmo dashboard](https://dashboard.nexmo.com) when prompted.\n\n[![Add credentials](https://www.nexmo.com/wp-content/uploads/2020/03/nexmo-prompt.png)](https://www.nexmo.com/wp-content/uploads/2020/03/nexmo-prompt.png)\n\nOnce added, your account will appear as an option on the dropdown.\n\n#### Customize Send SMS\n\nWith that, we are ready to customize the SMS!\n\nAs your Nexmo account is connected, Zapier will pull in any SMS enabled numbers on your account and use them to prepopulate the **From** dropdown with options to select. If you haven’t already purchased a number, use your complimentary credit to do so on the [dashboard](https://dashboard.nexmo.com).\n\nNext, add the phone number you would like the SMS reminders to be sent to, including the area code. Then, construct the SMS template with as many details as you please. Zapier will pull in all sorts of data from Google Calendar that may be included in the message. Integrate the data directly within the **Text** field like so:\n\n[![Customize SMS](https://www.nexmo.com/wp-content/uploads/2020/03/customize-sms.png)](https://www.nexmo.com/wp-content/uploads/2020/03/customize-sms.png)\n\n### Step 4: Test the Integration\n\n#### Send Data\n\nLet’s **Send Data** to **Test & Review** the Zap and ensure it’s functioning correctly.\n\n[![Test Zap](https://www.nexmo.com/wp-content/uploads/2020/03/final-test.png)](https://www.nexmo.com/wp-content/uploads/2020/03/final-test.png)\n\nIf the test is successful, you will receive an SMS reminder along with a success message.\n\n[![Receive success message](https://www.nexmo.com/wp-content/uploads/2020/03/success-zap.png)](https://www.nexmo.com/wp-content/uploads/2020/03/success-zap.png)\n\nLastly, toggle the Zap on to make it live.\n\n[![Toggle Zap on](https://www.nexmo.com/wp-content/uploads/2020/03/final-zap.png)](https://www.nexmo.com/wp-content/uploads/2020/03/final-zap.png)\n\nThat’s it! You’re all set to start receiving SMS reminders prior to your Google Calendar events.\n\n### What’s next?\n\nIf you often have phone meetings scheduled, there will soon be a way to enhance this workflow even further. With the upcoming **Voice integration**, you can receive an SMS reminder _and then_ be connected in a conference call between 2-50 participants. Automating workflows like this removes unnecessary manual work and enables you to focus your time and energy on what’s most important.\n\nIf you would like to learn about more ways to automate tasks using a Zapier workflow, look out for more tutorials in this space soon!"}