{"_filedata":{"slug":"sms-notifications-google-sheets-nodered-dr"},"title":"Sending Group Notifications with Google Sheets and Node-RED","description":"","thumbnail":"https://www.nexmo.com/wp-content/uploads/2020/03/TW_Google-Sheet-Notifications_1200x675-1.png","author":256,"published":true,"published_at":"2020-03-06T13:16:53","tags":[1126,1702,1557,1625,92],"body":"Ever got a phone call at 7:59 AM telling you your kid’s school is closed? It was handy, as you were only a couple miles away – on your way home, after dropping them off.\n\nThe announcement process in most schools is still manual nowadays, which works in most cases. When something unexpected happens though, like the school is snowed in, a handful of people scramble to call hundreds of parents. You might get the notification in time, or you could be part of the lucky bunch that ended up in the last batch at 7:59.\n\nIn this tutorial we’re going to build a Node-RED flow that programmatically sends out notifications to a list of contacts, using Google Sheets and the Nexmo SMS API.\n\nFollow along and pitch it to the principal? Saves you being stuck in traffic on a snow day.\n\n## Prerequisites\n\nBefore getting started, you’ll need a few things:\n\n*   A [Node-RED](https://nodered.org/docs/getting-started/installation) installation, be it a hosted version or on your machine\n*   A [Google account](https://myaccount.google.com/)\n*   A Nexmo account — [create one for free](https://dashboard.nexmo.com/sign-up) if you haven’t already\n*   A way to expose your server to the internet. This either means you’re running a hosted version of Node-RED or using a tunneling service like [ngrok](https://flows.nodered.org/node/node-red-contrib-ngrok) – get up to speed with this [Getting Started with Ngrok in Node-RED](https://www.nexmo.com/blog/2019/07/03/ngrok-in-node-red-dr/) tutorial\n\n## Setting Up Your Editor\n\nOnce you open your Node-RED Editor, make sure you have the following packages installed:\n\n*   [node-red-contrib-google-sheets](http://flows.nodered.org/node/node-red-contrib-google-sheets)\n*   [node-red-contrib-nexmo](https://flows.nodered.org/node/node-red-contrib-nexmo)\n\nTo do this, click on the hamburger menu, select _Manage Palette_. Check for already installed packages under _Nodes_, and get new ones from the _Install_ tab.\n\nWhen you’re done, make sure to restart Node-RED and you’re good to go!\n\n## Configuring Your Google Account\n\nTo interact with the _Google Sheets API_, you’ll need to use a service account – an identity that an instance can use to run API requests on your behalf. It will be used to identify apps running on your instance to other Google Cloud services.\n\nIn this case, your flow that reads a Google Sheet must first authenticate to the Google Sheets API.\n\nYou’ll have to create a service account and grant it access to the Google Sheets API. Next, update your app to pass the service account credentials to the Google Sheets API. This way, your flow authenticates seamlessly to the API without embedding any secret keys or user credentials.\n\n### Step 1: Create a New Service Account\n\nWe’ll start by creating a new project on the [Service Accounts Page](https://console.cloud.google.com/projectselector2/iam-admin/serviceaccounts?_ga=2.184919274.-272657095.1578084478&supportedpurview=project) of the Google Cloud Platform. Click on _CREATE_ to get started.\n\n![google service accounts create project](https://www.nexmo.com/wp-content/uploads/2020/03/google-service-accounts-create-project.png)\n\nNext, give your project a name, either select an organization or leave it blank, then press _CREATE_.\n\n![google service accounts name project](https://www.nexmo.com/wp-content/uploads/2020/03/google-service-accounts-name-project.png)\n\nYou’ll shortly see a notification pop up that your project has been created.\n\n![google service accounts project created](https://www.nexmo.com/wp-content/uploads/2020/03/google-service-accounts-project-created.png)\n\nNow that you have a project, let’s add a service account to it!\n\n![google create service account](https://www.nexmo.com/wp-content/uploads/2020/03/google-create-service-account.png)\n\n![google name service account](https://www.nexmo.com/wp-content/uploads/2020/03/google-name-service-account.png)\n\nNext, you’ll need to create a key that you’ll use to authenticate with the GSheet node in your flow. Click on _Create Key_, then select _JSON_ as a key type. Save this file when prompted – keep it handy as you’ll need it soon, then hit _Done_.\n\n![google service accounts create key](https://www.nexmo.com/wp-content/uploads/2020/03/google-service-accounts-create-key.png)\n\n### Step 2: Enable Google Sheets API for Your Project\n\nFrom the hamburger menu select _APIs and Services_ -> _Dashboard_, then click the _ENABLE APIS AND SERVICES_ button. Look for the _Google Sheets API_ in the API Library, open it and click _Enable_.\n\n![google sheets enable api for project](https://www.nexmo.com/wp-content/uploads/2020/03/google-sheets-enable-api-for-project.gif)\n\n### Step 3: Sharing Google Sheets with Your Service Account\n\nGo to the _Service Accounts_ page and make a note of the email address associated with the service account you’ve just created. You’ll need to use this email address to share your spreadsheets with the Service Account.\n\n![google service accouns email](https://www.nexmo.com/wp-content/uploads/2020/03/google-service-accouns-email.png)\n\n## Sending Group Notifications with Google Sheets and Node-RED\n\n### Create a Spreadsheet\n\nIn case you don’t have a Google Sheet ready, go ahead and create one now.\n\nGoogle Sheets use a cell-matrix system, where each column can be identified with a letter (starting with A as the first column) and rows are numbered (1 being the first row). In case you’d like to select the second element of the first row, this would be **B1**.\n\nYou can also select ranges of cells by using the **TOP\\_LEFTMOST\\_CELL:BOTTOM\\_RIGHTMOST\\_CELL** notation. For example, to select the second and third element of rows 1-5, use **B1:C5**.\n\nAfter creating a spreadsheet you’ll see a _Sheet1_ tab at the bottom of the screen, which is the worksheet you’re currently one. You can rename it or add more worksheets to your spreadsheet.\n\nFor this tutorial, I’m using one worksheet with 4 columns: Name, Surname, Phone, and Email – you’ll need at least 2 rows of data to follow along.  \nMake sure you add a phone number you have access to, so that you can test your flow later on.\n\nOnce your spreadsheet is ready, it’s time to share it with your Service Account.\n\n![google sheets share google sheet](https://www.nexmo.com/wp-content/uploads/2020/03/gsheets-share-google-sheet.png)\n\n### Getting the Data from Your Google Sheet\n\nStart your flow by adding a **GSheet** node to your workspace. Configure this node to pull in the data from your Google Sheet by filling out the following fields accordingly:\n\n| PARAMETERS | DESCRIPTION |\n| --- | --- |\n| **Creds** | Press the edit button to provide your Service Account key. Remember the JSON file you downloaded earlier? Copy and paste this JSON key in the text field. |\n| **Method** | Select _Get Cells_ from the drop-down menu. This will grab the data from the Google Sheet and pull it into your flow. |\n| **SpreadsheetID** | You can figure out your spreadsheet ID from the URL of your Google Sheet. For example, if the URL is _https://docs.google.com/spreadsheets/d/1mmXhj40aeSooxmtku3ma4auLyrHhO8xCSQsklZ1\\_BU/edit#gid=0_, the SpreadsheetID will be the string found in between `d/` and `/edit`: _1mmXhj40aeSooxmtku3ma4auLyrHhO8xCSQsklZ1\\_BU_. Have a look at your spreadsheet URL and find your SpreadSheetID. Then paste this string in the **SpreadSheetID** field. |\n| **Cells** | Select the cells where your data is located on the spreadsheet. In the example below, this value will be: `Sheet1!A2:D30`, as the data is found on the worksheet named “Sheet1”, in columns A-D on rows 2-30. Note that we’re not including the table headers. |\n\nOnce you’re done editing the **GSheet** node, press _Done_.\n\n![google sheets node setup](https://www.nexmo.com/wp-content/uploads/2020/03/google-sheets-node-setup.gif)\n\nNext, let’s have a look at the data we’re getting from the Google Sheets API.\n\nAdd an **inject** and a **debug** node to your workspace and connect them to the **GSheet** one. Hit _Deploy_, click on the **inject** node’s button, then have a look at your debug sidebar.\n\n![google sheets node](https://www.nexmo.com/wp-content/uploads/2020/03/google-sheet-node.png)\n\nYou’ll notice that the response in **msg.payload** is an array of arrays, each of these arrays having 4 elements – one line worth of data.\n\n#### Split the msg.payload Array\n\nThis data structure isn’t ideal for further processing, so let’s split the array of arrays into individual arrays.\n\nFortunately, there is a default node already in your palette that will do the heavy lifting for you.\n\nFind the **split** node under _sequence_ in your node palette o the left side of your screen. Add it to your workspace, connect it after the **GSheet** node, follow with a **debug**, then press _Deploy_ and run your flow again.\n\nGlance over to the debug sidebar and notice the response coming through as a sequence of individual arrays. This way we can process them one at a time, as they are coming in.\n\n![google sheets sms split node](https://www.nexmo.com/wp-content/uploads/2020/03/gsheets-sms-split-node.png)\n\n#### Set Delay\n\nIn most cases, you wouldn’t want to send out messages at this speed, be it via email, SMS or the channel of your choice.\n\nFor example, the Nexmo SMS API has a [throughput limit](https://help.nexmo.com/hc/en-us/articles/203993598-What-is-the-Throughput-Limit-for-Outbound-SMS-) for outbound SMS – all API keys are set with 30 API request per second throughput restriction by default. On top of this, there are also restrictions when sending from certain numbers, so you might be restricted to 1 SMS per second.\n\nTo make sure you’re not reaching the throughput limits, it’s a good idea to set a delay on each array coming through **msg.payload**.\n\nTo do this, find the **delay** node in the _function_ section of your node palette, and connect it after the **split** node. Double-click on it to open up the node properties and set the delay to 1 second – this should cover most use cases, but feel free to adjust it as needed.\n\n### Preparing the Message\n\nAt this point, we have all the information we need about the recipients, so let’s move on to the message!\n\nAlthough you could send the same message to all recipients, it’s always a good idea to make it a little more personal. Getting the bad news is frustrating enough, and a bad user experience won’t make it any better.\n\nAdding a bit of templating won’t only give your message a personal touch, it will also make it appear more professional.\n\nAdd a **template** node after **delay**. Double-click on it, set _Property_ to **msg.text** and get creative with your message in the text field!\n\nThis text field supports [Mustache templating](https://mustache.github.io/), so you could start with greeting the recipient using their name: `{{payload.0}}`. This expression references the first element of the **msg.payload** array, the recipient’s first name.\n\n![google sheets sms template node](https://www.nexmo.com/wp-content/uploads/2020/03/gsheets-sms-template-node.png)\n\nWhen you’re done editing, press _Done_, then _Deploy_.\n\n### Sending SMS Notifications\n\nThere are many channels available to deliver your notifications, but in bad weather conditions SMS might be your best bet, so we’ll start with this option.\n\nTo send the SMS messages, we’ll use the Nexmo [SMS API](https://developer.nexmo.com/api/sms).\n\nScroll down to the _nexmo_ section of your node palette and add **sendsms** to your workspace, connected after the **template** node.\n\nSet up this node by double-clicking on it and filling in the parameters below. You’ll find _API KEY_ and _API SECRET_ by clicking on the edit button next to _Nexmo Credentials_.\n\n| KEY | DESCRIPTION |\n| --- | --- |\n| **API KEY** | Your Nexmo API key, shown in your [account overview](https://dashboard.nexmo.com/getting-started-guide). |\n| **API SECRET** | Your Nexmo API secret, shown in your [account overview](https://dashboard.nexmo.com/getting-started-guide). |\n| **TO** | The number you are sending the SMS to, `{{msg.payload.2}}` in this case. |\n| **FROM** | The number or text shown on a handset when it displays your message. You can also set a custom alphanumeric FROM value if this feature is [supported in your country](https://help.nexmo.com/hc/en-us/articles/115011781468). |\n| **TEXT** | The content of your message. Use `{{msg.text}}` to reference the templated message you’ve created earlier. |\n\nMake sure _Unicode_ is ticked to keep the formatting of your message, then press _Done_ and _Deploy_.\n\n![google sheets send sms node setup](https://www.nexmo.com/wp-content/uploads/2020/03/gsheets-sendsms-node-setup.png)\n\nRun your flow again and see your templated messages appear in the debug sidebar.\n\n![google sheets templated sms in debug](https://www.nexmo.com/wp-content/uploads/2020/03/gsheets-templated-sms-debug.png)\n\n### Delivery Receipts\n\nWhen you make a successful request to the SMS API, it returns an array of message objects. Ideally, each of these has a status of 0, indicating that your message has successfully been scheduled for sending. These are the response objects that you’ve just seen in the debug area.\n\nWhile inspecting this output is quite helpful in determining what the Nexmo SMS API did, there is no guarantee that the message reached the recipient’s handset. Not exactly what you want to hear while sending out snow day alerts, is it?\n\nOnce the message reaches its destination, the carrier returns a [**Delivery Receipt**](https://developer.nexmo.com/messaging/sms/guides/delivery-receipts) to Nexmo – so don’t panic! All you need to do is set up a webhook endpoint that Nexmo can forward these **Delivery Receipts** to.\n\nConnect a **http** input node to a **http response** node, as well as to a **debug** node, then fill in the _URL_ field with `/receipt` in the **http** input node.\n\nNext, you’ll have to let the Nexmo SMS API know where it should forward the delivery receipts. Go to your [API settings](https://dashboard.nexmo.com/settings) in the **Default SMS Setting** section.  \nSet the default webhook URL for delivery receipts to `YOUR_URL/receipt`, then _Save changes_.\n\n![default sms settings nexmo dashboard](https://www.nexmo.com/wp-content/uploads/2020/03/default-sms-settings-nexmo-dashboard.png)\n\nNow you can rest assured that your snow day notifications have indeed reached everyone on your list! Don’t take my word for it though, head over to the debug sidebar and read through your delivery receipts.\n\n![google sheets sms event webhook](https://www.nexmo.com/wp-content/uploads/2020/03/gsheets-sms-event-webhook.png)\n\n## Where Next?\n\n### Extra Credit: Write Your Delivery Receipts to the Google Sheet\n\nAlthough the debug sidebar gives you all the insight you’ll ever need, sometimes it’s easier to grasp the result if the data is presented in a more organized fashion.\n\nIn this section, we’ll look into writing your delivery receipts back to the same spreadsheet, on a different worksheet(tab).\n\n#### Pick Your Data\n\nThe delivery receipts will contain the following properties of the **msg.payload** object:\n\n| PROPERTY | DESCRIPTION |\n| --- | --- |\n| msisdn | The number the message was sent to. |\n| to | Your Nexmo number or the SenderID you’ve set when sending the SMS. |\n| network-code | The Mobile Country Code Mobile Network Code (MCCMNC) of the carrier the destination phone number is registered with. |\n| messageId | The Nexmo ID for this message. |\n| price | The cost of this message. |\n| status | Will be one of: _delivered_, _expired_, _failed_, _rejected_, _accepted_, _buffered_ or _unknown_, based on where the message is in the delivery process. |\n| scts | When the delivery receipt was received from the carrier in _YYMMDDHHMM_ format. For example, 2001011400 is at 2020-01-01 14:00 |\n| err-code | The status of the request. Will be a non 0 value in case of an error. See the [Delivery Receipt documentation](https://developer.nexmo.com/messaging/sms/guides/delivery-receipts#dlr-error-codes) for more details. |\n| api-key | Your Nexmo API key. |\n| message-timestamp | The time when Nexmo started to push this Delivery Receipt to your webhook endpoint. |\n\nDecide on which of these parameters matter to you, then using a **change** node, set **msg.payload** to an array of the respective properties.\n\nFor example, I’m interested in the timestamp, recipient’s number, status, error code and message ID, so I’ll set **msg.payload** to the following _expression_:\n\n<textarea wrap=\"soft\" class=\"crayon-plain print-no\" data-settings=\"dblclick\" readonly=\"\" style=\"-moz-tab-size:4; -o-tab-size:4; -webkit-tab-size:4; tab-size:4; font-size: 14px !important; line-height: 22px !important;\">[payload.`message-timestamp`, payload.msisdn, payload.status, payload.`err-code`, payload.messageId]</textarea>\n\n<table class=\"crayon-table\"><tbody><tr class=\"crayon-row\"><td class=\"crayon-nums \" data-settings=\"show\"><div class=\"crayon-nums-content\" style=\"font-size: 14px !important; line-height: 22px !important;\"><div class=\"crayon-num\" data-line=\"crayon-5e9ddc1a74331847569419-1\">1</div><div class=\"crayon-num crayon-striped-num\" data-line=\"crayon-5e9ddc1a74331847569419-2\">2</div></div></td><td class=\"crayon-code\"><div class=\"crayon-pre\" style=\"font-size: 14px !important; line-height: 22px !important; -moz-tab-size:4; -o-tab-size:4; -webkit-tab-size:4; tab-size:4;\"><div class=\"crayon-line\" id=\"crayon-5e9ddc1a74331847569419-1\"><span class=\"crayon-sy\">[</span><span class=\"crayon-v\">payload</span><span class=\"crayon-sy\">.</span><span class=\"crayon-sy\">`</span><span class=\"crayon-v\">message</span><span class=\"crayon-o\">-</span><span class=\"crayon-v\">timestamp</span><span class=\"crayon-sy\">`</span><span class=\"crayon-sy\">,</span><span class=\"crayon-h\"> </span><span class=\"crayon-v\">payload</span><span class=\"crayon-sy\">.</span><span class=\"crayon-v\">msisdn</span><span class=\"crayon-sy\">,</span><span class=\"crayon-h\"> </span><span class=\"crayon-v\">payload</span><span class=\"crayon-sy\">.</span><span class=\"crayon-v\">status</span><span class=\"crayon-sy\">,</span><span class=\"crayon-h\"> </span><span class=\"crayon-v\">payload</span><span class=\"crayon-sy\">.</span><span class=\"crayon-sy\">`</span><span class=\"crayon-v\">err</span><span class=\"crayon-o\">-</span><span class=\"crayon-v\">code</span><span class=\"crayon-sy\">`</span><span class=\"crayon-sy\">,</span><span class=\"crayon-h\"> </span><span class=\"crayon-v\">payload</span><span class=\"crayon-sy\">.</span><span class=\"crayon-v\">messageId</span><span class=\"crayon-sy\">]</span></div><div class=\"crayon-line crayon-striped-line\" id=\"crayon-5e9ddc1a74331847569419-2\">&nbsp;</div></div></td></tr></tbody></table>\n\nConnect this **change** node into the **/receipt** webhook, then follow with a **GSheet** node.\n\n#### Write Your Data to the Google Sheet\n\nAdd another worksheet(tab) to your Google Sheet and make a note of its name – will be “Sheet2” by default.\n\nNext, head back over to your Node-RED editor and open up the **GSheet** node properties. Select your credentials from the _creds_ drop-down, select **Append Row** as a _Method_, fill in your _SpreadsheetID_, then specify the cell range where you’d like the data to be written. In my case this will be _Sheet2!A:E_, as I’d like the data to be spread accross columns A-E on worksheet “Sheet2”.\n\n![google sheets append row setup](https://www.nexmo.com/wp-content/uploads/2020/03/google-sheets-append-row-setup.png)\n\nWhen you’re ready, click _Done_ and _Deploy_, then run your flow again.\n\n🎉Congratulations! Your Delivery Receipts have now been logged onto the second worksheet of your spreadsheet. Head over to your Google Sheet and check them out!\n\n![google sheets delivery receipts logged](https://www.nexmo.com/wp-content/uploads/2020/03/google-sheets-delivery-receipts-logged.png)\n\n### Further Hack Ideas\n\nTired of having to open up your Node-RED Editor to start your flow? Experiment with different ways to kick it off!\n\n*   Try replacing the **inject** node with an [inbound SMS](https://www.nexmo.com/blog/2019/04/24/receive-sms-messages-node-red-dr/) webhook. Send an SMS to your Nexmo number to achieve your task!\n*   [Inbound calls](https://www.nexmo.com/blog/2019/05/09/receive-phone-calls-node-red-dr/) would be another great option! You could even build on it and set up an [Interactive Voice Response Menu](https://www.nexmo.com/blog/2020/01/08/interactive-voice-response-node-red-dr)\n*   Set up a user interface using the [dashboard nodes](https://flows.nodered.org/node/node-red-dashboard)\n\n### Resources\n\n*   [SMS API Reference](https://developer.nexmo.com/api/sms)\n*   [Getting Started with Ngrok in Node-RED](https://www.nexmo.com/blog/2019/07/03/ngrok-in-node-red-dr/)\n*   Get a better understanding of [delivery receipts](https://developer.nexmo.com/messaging/sms/guides/delivery-receipts)\n*   [Mustache templating](https://mustache.github.io/)\n*   [JSONata Docs](http://docs.jsonata.org/overview.html)\n*   [JSONata Exerciser](https://try.jsonata.org/)\n\n### Try Another Tutorial\n\n*   [How to Build an IVR using Node-RED and the Nexmo APIs](https://www.nexmo.com/blog/2020/01/08/interactive-voice-response-node-red-dr)\n*   [Build Your Own Voicemail With Node-RED and the Nexmo Voice API](https://www.nexmo.com/blog/2019/11/14/build-voicemail-node-red-voice-api-dr)\n*   [Forward a Call via a Voice Proxy with Node-RED](https://www.nexmo.com/blog/2019/10/17/forward-call-via-voice-proxy-node-red-dr)\n*   [Build a Conference Call with Node-RED](https://www.nexmo.com/blog/2019/10/07/conference-call-node-red-dr)\n*   [Verify Phone Numbers with Node-RED](https://www.nexmo.com/blog/2019/09/25/verify-phone-numbers-with-node-red-dr)\n*   [How to Stream Audio into a Call with Node-RED](https://www.nexmo.com/blog/2019/07/15/stream-audio-node-red-dr)\n*   [How to Make Text-to-Speech Phone Calls with Node-RED](https://www.nexmo.com/blog/2019/06/14/make-text-to-speech-phone-calls-node-red-dr/)\n*   [How to Receive Phone Calls with Node-RED](https://www.nexmo.com/blog/2019/05/09/receive-phone-calls-node-red-dr/)\n*   [How to Send SMS Messages with Node-RED](https://www.nexmo.com/blog/2019/04/17/send-sms-messages-node-red-dr/)\n*   [How to Receive SMS Messages with Node-RED](https://www.nexmo.com/blog/2019/04/24/receive-sms-messages-node-red-dr/)\n\nwindow.addEventListener('DOMContentLoaded', (event) => { document.querySelectorAll(\".gif-player\").forEach(image => { image.src = image.src.replace(/\\\\.gif$/g, \".png\") image.addEventListener(\"click\", (event) => { if (event.target.src.indexOf(\".gif\") > 0) { image.src = image.src.replace(/\\\\.gif$/g, \".png\") } else { image.src = image.src.replace(/\\\\.png$/g, \".gif\") } }) }) });\n\n.gif-player { cursor: pointer; } img.alignnone { border-width: 0px !important; }"}