{"_filedata":{"slug":"introducing-the-ncco-examples-collection-dr"},"title":"Introducing the NCCO Examples Collection","description":"","thumbnail":"https://www.nexmo.com/wp-content/uploads/2019/10/E_NCCO-Examples_1200x600.png","author":247,"published":true,"published_at":"2019-10-25T08:00:57","tags":[919,1637,535,595],"body":"<p>At Nexmo, we take our (award-winning) developer documentation very seriously. You will find detailed API reference, lots of code samples, high-level concept explanations&#8230; Everything you&#8217;d expect. However, we don&#8217;t want to take ourselves or our products too seriously, which is why we shared our <a href=\"https://nexmo-community.github.io/ncco-examples/\">NCCO examples collection</a>.</p>\n<p><a href=\"https://www.nexmo.com/wp-content/uploads/2019/10/ncco-examples.png\"><img src=\"https://www.nexmo.com/wp-content/uploads/2019/10/ncco-examples.png\" alt=\"\" width=\"1149\" height=\"441\" class=\"alignnone size-full wp-image-30576\" /></a></p>\n<p>The NCCO examples collection is a place for you to go to explore for one-off, potentially silly(!) examples to use in your Nexmo Voice API applications. NCCO stands for &#8220;Nexmo Call Control Object&#8221; &#8211; an NCCO is a set of instructions that a voice call will follow, such as &#8220;start a recording&#8221;, &#8220;speak a greeting to the user&#8221;, &#8220;ask the user to press a number on the keypad&#8221; and so on. In the NCCO examples collection, we keep the example code we use ourselves.</p>\n<p>You&#8217;ll find tricks like:</p>\n<ul>\n<li>connecting an incoming phone call to an outgoing one</li>\n<li>changing the voice used to speak to the caller</li>\n<li>using SSML to add some <em>feeling</em> to the spoken message</li>\n</ul>\n<p>Best of all, the collection is all in a <a href=\"https://github.com/nexmo-community/ncco-examples\">GitHub project</a> so you can work with it directly, and of course patches are more than welcome! The rules are: there are no rules, add your examples and the sillier the better!</p>\n<p>If this sounds like fun then you might also want to join us in person at the upcoming Vonage Campus event where you can get a hands-on tutorial on the Voice API and try some of the NCCO examples out in your own applications.</p>\n"}