{"_filedata":{"slug":"nexmo-at-birmingham-on-rails-dr"},"title":"Nexmo at Birmingham on Rails!","description":"","thumbnail":"https://www.nexmo.com/wp-content/uploads/2020/01/TW_Birmingham-on-Rails_1200x675.png","author":301,"published":true,"published_at":"2020-01-22T14:02:06","tags":[366,360,1555,375],"body":"<p><a href=\"https://birminghamonrails.com/\"><img src=\"https://www.nexmo.com/wp-content/uploads/2020/01/Birmingham_on_Rails_Logo.png\" alt=\"\" width=\"333\" height=\"279\" class=\"aligncenter size-full wp-image-31101\" /></a></p>\n<p>You can find Nexmo&#8217;s Developer Advocates all around the world every year sharing best practices and insights in software development, communications APIs and more. This year we are excited to join the inaugural <a href=\"https://birminghamonrails.com/\">Birmingham on Rails</a> conference in Birmingham, Alabama on Friday, January 31st. The free conference is entirely community-driven and seeks to bring further opportunities for learning and networking to the American Southeast Ruby developer community. The conference will be keynoted by Sandi Metz and Stephan Hagemann. Sandi needs no introduction to the Ruby community. She is the author of <em>Practical Object-Oriented Design</em> and <em>99 Bottles of OOP</em>. Stephan is a leading thinker as well in Ruby’s performance and maintainability, and the recent author of <em>Component-based Rails Applications</em>.</p>\n<p><img src=\"https://www.nexmo.com/wp-content/uploads/2020/01/Ben_Greenberg_Headshot.jpg\" alt=\"\" width=\"108\" height=\"104\" class=\"alignleft size-full wp-image-31098\" /> Ben Greenberg, Nexmo&#8217;s Ruby Developer Advocate, will be one of the eight speakers at the conference and will be presenting on building Ruby applications that leverage natural language processing and semantic analysis. In his talk, <em>What&#8217;s Love Got To Do With It?</em>, Ben will break down some of the foundational concepts of how machines process human language, and in the process will share insights from linguistics and behavioral psychology. He will then demonstrate practical applications of this technology to build socially connected Ruby apps to glean insight on the &#8220;mood of the news&#8221;.</p>\n<h2>Are You a 💎 Rubyist and Live in Alabama? Let&#8217;s Have Coffee!</h2>\n<p>While Birmingham on Rails takes place on January 31st, Ben will be in Birmingham the week leading up to the conference and would love to connect! Are you a Rubyist and want to talk about building Ruby apps that communicate with the world? Then let&#8217;s meet up! Even if you never dabbled in Ruby or just put your toes in the water once or twice, regardless, Ben will be in Birmingham the week of January 27th and invites you to a cup of coffee and conversation. He <em>may</em> even have special coupon cards with free Nexmo credit to hand out to those he meets with! 🤩</p>\n<p>Connect with Ben on <a href=\"https://twitter.com/RabbiGreenberg\">Twitter</a> or on the <a href=\"https://developer.nexmo.com/community/slack\">Nexmo Community Slack</a> to set up a time to meet.</p>\n"}