{"_filedata":{"slug":"benjamin-aronov-joins-the-nexmo-developer-relations-team-dr"},"title":"Benjamin Aronov Joins the Nexmo Developer Relations Team","description":"","thumbnail":"https://www.nexmo.com/wp-content/uploads/2020/02/st-louis.jpg","author":363,"published":true,"published_at":"2020-02-21T15:57:23","tags":[1615],"body":"<p>Hello! שלום! Здравствуйте!</p>\n<p>I’m Benjamin Aronov, and I’m thrilled to be joining the Developer Relations team at Nexmo/Vonage.</p>\n<p>After attending a <a href=\"https://twitter.com/rabbigreenberg?lang=en\">🥑Ben Greenberg</a> meetup at <a href=\"https://www.vonage.com/\">Vonage’s</a> stunning Tel Aviv office, I knew that this was exactly where I wanted to work. From the 39th floor, not only are you surrounded by Tel Aviv’s skyline, shimmering in the sea’s silhouette, but also by legal patents filed by the tech wizards bustling throughout the office. This place is every definition of cool.</p>\n<p>I grew up in Saint Louis, USA (America’s most under appreciated city!). My parents moved to St. Louis from Moscow, USSR, as political refugees in the fall of 1991. A few months later I arrived! I consider myself very fortunate to have grown up a Russian Jewish immigrant kid in a largely Catholic neighborhood where most of my friends’ families had been there for three or more generations. These early tribulations, trying to fit in to so many completely different communities, instilled awareness about how people form groups and identities.</p>\n<p>My early twenties could best be defined by chaos. After jumping from degree to degree (philosophy, economics, engineering), I completed my first programming bootcamp in the spring of 2016. Building a fully functioning app triggered a sense of accomplishment and rush of dopamine I had never known. I was hooked!</p>\n<p>Even though I spent weeks and months in front of my text editor self-learning, I had a lot of difficulty breaking into the tech industry. I even thought my year-plus experiment in coding was all for naught and formed a bagel business.</p>\n<p>Then in Spring 2018, I decided I needed to make a big life change. So I sold my few belongings, packed an old army bag and headed off to Tel Aviv! To refresh my skills and gain a network I signed up for Le Wagon bootcamp.</p>\n<p>Not only did the bootcamp provide one “Aha! Now I really get it!” moment after another, but it also provided a job. I stayed at Le Wagon for another year working as a teacher and community manager. I was teaching code, but equally I was building a community from scratch. The most powerful experience was that every 3 months a whole new batch of individuals would get on stage to demo their production apps that just a few weeks earlier hadn’t even been ideas.</p>\n<p>If that wasn’t information overload, you can reach me on <a href=\"https://twitter.com/AronovBenjamin\">Twitter</a>!</p>\n<p><em>Photo by Ronni Kurtz on <a href=\"https://images.unsplash.com/photo-1571147085592-fe1f9c5ae1a1\">Unsplash</a></em></p>\n"}