{"_filedata":{"slug":"announcing-nexmos-net-server-sdk-version-4-3-1-release-dr"},"title":"Announcing Nexmo&#8217;s .NET Server SDK Version 4.3.1 Release","description":"","thumbnail":"https://www.nexmo.com/wp-content/uploads/2020/02/E_Dotnet-SDK-Update_1200x600.png","author":349,"published":true,"published_at":"2020-02-24T15:08:38","tags":[1682],"body":"<p>Hello again! This week we are releasing a new version of the .NET SDK &#8211; 4.3.1. This version contains two bug fixes.</p>\n<h2>Truncated &#8216;loop&#8217; Parameter in Stream and Talk Commands</h2>\n<p>Version 4.3.1 of the SDK fixes an issue where the &#8216;loop&#8217; parameter would be truncated if set to 0 in Voice API Stream and Talk requests. Setting the loop parameter to 0 will now result in an infinite loop, as per the <a href=\"https://developer.nexmo.com/api/voice#startStream\">API Spec</a>.</p>\n<h2>User Agent Throwing Exceptions for Certain Operating Systems</h2>\n<p>This version of the SDK also fixes an issue where on certain operating systems—specifically those whose description contains the <code>(</code> character (e.g. <code>Linux4.9.0-7-amd64#1SMPDebian4.9.110-3+deb9u2(2018-08-13)</code>)—a formatting exception would be thrown. This is because the Core CLR was interpreting the parentheses as comments in the user agent, without a preceding space, creating a formatting error. This was also an issue as the formatting of the User Agent wasn&#8217;t compliant with our <a href=\"https://github.com/Nexmo/repo-standards/blob/master/set-user-agent.md\">User Agent standards</a>. From now on, the User Agent the SDK uses will be:</p>\n<p><code>$\"nexmo-dotnet/{libraryVersion} dotnet/{languageVersion}\"</code></p>\n<p>Rather than including the full runtime (OS + .NET framework version), it will now only include the .NET version.</p>\n<h2>More to Come</h2>\n<p>There&#8217;s much more to come, but until then feel free to follow the <a href=\"https://github.com/Nexmo/nexmo-dotnet\">.NET SDK in GitHub</a> for real-time updates. If you have any questions, issues, or concerns, please feel free to raise them there or find me, @Steve Lorello, in our <a href=\"https://developer.nexmo.com/community/slack\">community slack</a>, and I&#8217;ll be more than happy to help.</p>\n"}