{"_filedata":{"slug":"igor-wojda-joins-the-vonage-developer-relations-team-dr"},"title":"Igor Wojda Joins the Vonage Developer Relations Team","description":"","thumbnail":"https://www.nexmo.com/wp-content/uploads/2020/03/IMG_20191230_142410-1.jpg","author":365,"published":true,"published_at":"2020-03-11T17:00:36","tags":[937,1707,1615],"body":"<p>My name is Igor and I am very excited to join Vonage as Android Developer Advocate.</p>\n<p>As a kid, I was always fascinated by computers. The mystery and infinite capacities always spiked my levels of curiosity. Now, many years later I am a Software Engineer with over 12 years of experience.</p>\n<p>I have been involved in many IT projects, building various applications across industries, organizations types, team sizes, methodologies, and technologies. Every project is unique having its own set of constraints, but one common characteristic is a neverending stream of emerging challenges—this is what I love about IT.</p>\n<p>At some point, I decided to share my knowledge and experience with the community, so I became a technical reviewer of the second Kotlin book ever published &#8211; <a href=\"https://www.manning.com/books/kotlin-in-action\" target=\"_blank\" rel=\"noopener noreferrer\">Kotlin In Action</a> and a co-author of <a href=\"https://www.packtpub.com/gb/application-development/android-development-kotlin\" target=\"_blank\" rel=\"noopener noreferrer\">Android Development with Kotlin</a>.</p>\n<p>On top of this, I am inspiring developers by writing <a href=\"https://medium.com/@igorwojda\" target=\"_blank\" rel=\"noopener noreferrer\">articles</a>, speaking at conferences and contributing to <a href=\"http://github.com/igorwojda\" target=\"_blank\" rel=\"noopener noreferrer\">open-source projects</a>.</p>\n<p>Nowadays I am specializing in mobile development. Android is my platform and Kotlin is my language of choice. However, my personal favorite topic is the <a href=\"https://github.com/igorwojda/android-showcase\" target=\"_blank\" rel=\"noopener noreferrer\">application architecture</a>. With so many moving parts designing high quality modular, scalable, testable architecture that will support an application&#8217;s growth can be quite challenging.</p>\n<p>At Vonage, I will be working closely with external developers using our <a href=\"https://developer.nexmo.com/client-sdk/sdk-documentation/android/release-notes\">SDK</a>. My goal is to improve the developer experience by writing high-quality documentation, building sample projects, writing tutorials and polishing the Client SDK API.</p>\n<p>I want to make the SDK not only more intuitive, easier to use but also more flexible and convenient to integrate into modern Android applications.</p>\n<p>Follow me on twitter to stay in touch <a href=\"https://twitter.com/igorwojda\" target=\"_blank\" rel=\"noopener noreferrer\">@igorwojda</a>.</p>\n"}